# DGNFile Format Enumeration

Source: https://www.revitapidocs.com/2026/a3229830-0f4f-8732-2d2f-554b4ef86b1a.htm

---

| DGNFile Format Enumeration |
| --- |

An enumerated type listing available Microstation versions into which a file may be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum DGNFileFormat
```

```
Public Enumeration DGNFileFormat
```

```
public enum class DGNFileFormat
```

```
type DGNFileFormat
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Default | 20 | The Autodesk Revit application's default file format. |
| DGNVersion7 | 19 | Microstation V7 file format. |
| DGNVersion8 | 20 | Microstation V8 file format. |

See Also

#### Reference

Autodesk.Revit.DB Namespace